/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: awoods <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/12/04 23:19:04 by awoods            #+#    #+#             */
/*   Updated: 2021/12/04 23:19:18 by awoods           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "cub3D.h"

int	main(int argc, char **argv)
{
	t_plan	plan;
	t_plr	plr;

	parser(argc, argv, &plan, &plr);

	/** основная работа */

	close_program("OK", &plan, 0); /** в конце */
	return (0);
}
